evaluation_tests/test2_webserver/tc2_html_curve/step09_rps3200__.txt
Running 30s test @ http://54.235.233.71/
  4 threads and 256 connections
  Thread calibration: mean lat.: 1664.178ms, rate sampling interval: 5709ms
  Thread calibration: mean lat.: 1654.090ms, rate sampling interval: 5660ms
  Thread calibration: mean lat.: 1661.999ms, rate sampling interval: 5697ms
  Thread calibration: mean lat.: 1647.017ms, rate sampling interval: 5631ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.01s     1.76s   10.27s    59.07%
    Req/Sec   556.50     11.35   571.00     58.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.96s 
 75.000%    7.50s 
 90.000%    8.40s 
 99.000%    9.50s 
 99.900%   10.04s 
 99.990%   10.15s 
 99.999%   10.28s 
100.000%   10.28s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2828.287     0.000000            1         1.00
    3667.967     0.100000         4290         1.11
    4210.687     0.200000         8580         1.25
    4747.263     0.300000        12857         1.43
    5283.839     0.400000        17150         1.67
    5959.679     0.500000        21425         2.00
    6299.647     0.550000        23577         2.22
    6627.327     0.600000        25721         2.50
    6930.431     0.650000        27878         2.86
    7217.151     0.700000        30015         3.33
    7503.871     0.750000        32160         4.00
    7647.231     0.775000        33216         4.44
    7786.495     0.800000        34281         5.00
    7929.855     0.825000        35372         5.71
    8077.311     0.850000        36436         6.67
    8228.863     0.875000        37507         8.00
    8306.687     0.887500        38027         8.89
    8396.799     0.900000        38607        10.00
    8478.719     0.912500        39098        11.43
    8577.023     0.925000        39633        13.33
    8683.519     0.937500        40171        16.00
    8749.055     0.943750        40450        17.78
    8814.591     0.950000        40740        20.00
    8880.127     0.956250        40985        22.86
    8953.855     0.962500        41256        26.67
    9035.775     0.968750        41523        32.00
    9084.927     0.971875        41662        35.56
    9134.079     0.975000        41790        40.00
    9191.423     0.978125        41917        45.71
    9256.959     0.981250        42046        53.33
    9338.879     0.984375        42183        64.00
    9379.839     0.985938        42245        71.11
    9428.991     0.987500        42315        80.00
    9469.951     0.989062        42381        91.43
    9535.487     0.990625        42454       106.67
    9601.023     0.992188        42516       128.00
    9650.175     0.992969        42549       142.22
    9707.519     0.993750        42580       160.00
    9773.055     0.994531        42612       182.86
    9830.399     0.995313        42648       213.33
    9871.359     0.996094        42681       256.00
    9895.935     0.996484        42702       284.44
    9912.319     0.996875        42719       320.00
    9928.703     0.997266        42733       365.71
    9953.279     0.997656        42753       426.67
    9969.663     0.998047        42766       512.00
    9986.047     0.998242        42772       568.89
    9994.239     0.998437        42782       640.00
   10002.431     0.998633        42789       731.43
   10018.815     0.998828        42797       853.33
   10035.199     0.999023        42805      1024.00
   10043.391     0.999121        42811      1137.78
   10051.583     0.999219        42815      1280.00
   10059.775     0.999316        42818      1462.86
   10076.159     0.999414        42823      1706.67
   10084.351     0.999512        42826      2048.00
   10100.735     0.999561        42831      2275.56
   10100.735     0.999609        42831      2560.00
   10108.927     0.999658        42832      2925.71
   10117.119     0.999707        42834      3413.33
   10125.311     0.999756        42838      4096.00
   10125.311     0.999780        42838      4551.11
   10125.311     0.999805        42838      5120.00
   10133.503     0.999829        42839      5851.43
   10141.695     0.999854        42841      6826.67
   10141.695     0.999878        42841      8192.00
   10149.887     0.999890        42842      9102.22
   10149.887     0.999902        42842     10240.00
   10158.079     0.999915        42843     11702.86
   10158.079     0.999927        42843     13653.33
   10174.463     0.999939        42844     16384.00
   10174.463     0.999945        42844     18204.44
   10174.463     0.999951        42844     20480.00
   10239.999     0.999957        42845     23405.71
   10239.999     0.999963        42845     27306.67
   10239.999     0.999969        42845     32768.00
   10239.999     0.999973        42845     36408.89
   10239.999     0.999976        42845     40960.00
   10280.959     0.999979        42846     46811.43
   10280.959     1.000000        42846          inf
#[Mean    =     6011.575, StdDeviation   =     1761.448]
#[Max     =    10272.768, Total count    =        42846]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  65474 requests in 30.00s, 45.83MB read
Requests/sec:   2182.44
Transfer/sec:      1.53MB